# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

n = int(input("Введите количество кустов: "))
quantity = []
for i in range(n):
    x = int(input("Введите урожайность куста: "))
    quantity.append(x)
quan_summ = []
for i in range(len(quantity) - 1):
    quan_summ.append(quantity[i-1] + quantity[i] + quantity[i+1])
maximum = max(quan_summ)
print(f'Максимальная урожайность секции {maximum} ягод.')